proyecto_news_cover2/framework/app/Models/categories.php

    public function getCategories()
    {
        return $this->findAll();
---
SELECT *
FROM `categories`

    public function saveCategory($name)
    {
        // Guarda la nueva categoría
        $this->insert(['name' => $name]);
---
INSERT INTO `categories` (`name`) VALUES ('Entretenimiento')