proyecto_news_cover2/framework/app/Models/news_sources.php

    public function getUserNewsSources($userId)
    {
        // Obtener fuentes de noticias específicas para el usuario
        return $this->select('news_sources.id, news_sources.category_id, categories.name AS category_name, news_sources.name')
            ->join('categories', 'news_sources.category_id = categories.id')
            ->where('user_id', $userId)
            ->distinct()
            ->findAll();
---
SELECT DISTINCT `news_sources`.`id`, `news_sources`.`category_id`, `categories`.`name` AS `category_name`, `news_sources`.`name`
FROM `news_sources`
JOIN `categories` ON `news_sources`.`category_id` = `categories`.`id`
WHERE `user_id` = '2'

    public function userHasNews($user_id)
    {
        return $this->db->table('news')->where('user_id', $user_id)->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `news`
WHERE `user_id` = '2'

    public function getUserCategoriesNews($user_id)
    {
        // SELECT category_id FROM news WHERE user_id = ? GROUP BY category_id
        $query = $this->select('category_id')
            ->where('user_id', $user_id)
            ->groupBy('category_id')
            ->get();
---
SELECT `category_id`
FROM `news_sources`
WHERE `user_id` = '2'
GROUP BY `category_id`