proyecto_news_cover2/framework/app/Models/user.php

    public function authenticate($email, $password)
    {
        // Utiliza el helper de CodeIgniter para proteger contra inyecciones SQL
        $email = esc($email);
        $password = esc($password);

        // Realiza la consulta utilizando el builder de CodeIgniter
        $user = $this->where(['email' => $email, 'password' => $password])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'fabianamadri21@gmail.com'
AND `password` = '12345'
 LIMIT 1